
### **ุดุฑุญ ุฅูุดุงุก VLAN ุนูู ุงูุณููุชุด**

๐น **ุงูููุฑุฉ ุงูุฃุณุงุณูุฉ**  
ุงูู VLAN (Virtual LAN) ุจุชูุณู ุงูุดุจูุฉ ุฌูู ุงูุณููุชุด ูุนุฏุฉ ุดุจูุงุช ููุทููุฉ. ูู VLAN ุชุนุชุจุฑ broadcast domain ูููุตู.  
ุงูุจูุงูุงุช ุงูุฎุงุตุฉ ุจุงูู VLANs ุจุชุชุฎุฒู ูู ููู ุงุณูู **vlan.dat** ุนูู ุงูููุงุด ุจุชุงุน ุงูุณููุชุด.

---

### **ุงูุฎุทูุงุช ุงูุนูููุฉ:**

1. **ุงุฏุฎู ุนูู ูุถุน ุงูุฅุนุฏุงุฏุงุช ุงูุนุงูุฉ (Global Configuration Mode):**
    
    ```
    Switch# configure terminal
    ```
    
    - ููุง ุจุชุจุฏุฃ ุชุฏุฎู ุฃูุงูุฑ ุงูุชููุฆุฉ.
        
2. **ุฃูุดุฆ VLAN ุจุฑูู ูุญุฏุฏ** (ูุซูุงู: VLAN 20):
    
    ```
    Switch(config)# vlan 20
    ```
    
    - ูุฏู ุงูุณููุชุด ุฃูุดุฃ VLAN ุจุฑูู 20.
        
    - ูู ุงูุฑูู ูุด ููุฌูุฏ ูุจู ูุฏูุ ุงูุณููุชุด ููุถููู.
        
3. **ุชุณููุฉ ุงูู VLAN (ุงุฎุชูุงุฑู):**
    
    ```
    Switch(config-vlan)# name student
    ```
    
    - ูู ูุง ูุชุจุชุด ุงุณูุ ููุธูุฑ ุจุงูุงุณู ุงูุงูุชุฑุงุถู ุฒู `VLAN0020`.
        
    - ุงูุงุณู ุจูุณูู ุนููู ุชุนุฑู ุงูุบุฑุถ ูู VLAN ุฏู (ูุซูุงู: student, admin, HR).
        
4. **ุงูุฎุฑูุฌ ูู ูุถุน ุงูุฅุนุฏุงุฏุงุช:**
    
    ```
    Switch(config-vlan)# end
    ```
    
    ุฃู ุชูุฏุฑ ุชุณุชุฎุฏู:
    
    ```
    Switch(config-vlan)# exit
    Switch(config)# exit
    ```
    

---

### **ูุซุงู ูุงูู ุนููู:**

```
 configure terminal
 vlan 20
 name student
 end
```


---

### **ุงูุชุญูู ูู ุฅูุดุงุก ุงูู VLAN:**

ุจุนุฏ ูุง ุชุฎูุตุ ุชุฃูุฏ ุฅู VLAN ุงุชุนููุช:

```
S1# show vlan brief
```

ูุชูุงูู VLAN 20 ููุฌูุฏุฉ ุจุงูุงุณู `student`.

---

ุชุญุจ ุฃุดุฑุญูู ููุงู **ุฅุฒุงู ูุฑุจุท ุจูุฑุช ูุนูู ุจุงูู VLAN ุฏู** (ุนุดุงู ุงูุฃุฌูุฒุฉ ูุนูุงู ุชุณุชุฎุฏููุง)ุ