
### ๐ ุงูููุฑุฉ

ุฅูุช ุจุนุฏ ูุง ุชุนูู VLAN (ูุซูุงู VLAN 20)ุ ูุงุฒู ุชุฑุจุทูุง ุจูููุฐ ูุนูู ูู ุงูุณููุชุด ุนุดุงู ุฃู ุฌูุงุฒ ูุชูุตู ุนูู ุงููููุฐ ุฏู ูุดุชุบู ุถูู ููุณ ุงูู VLAN.

---

### ๐ ุงูุฎุทูุงุช ุงูุนูููุฉ

1. **ุงุฏุฎู ูุถุน ุงูุฅุนุฏุงุฏุงุช ุงูุนุงูุฉ (Global Configuration):**
    
    ```
    Switch# configure terminal
    ```
    
2. **ุงุฎุชูุงุฑ ุงููููุฐ ุงููู ุนุงูุฒ ุชุฑุจุทู (ูุซูุงู fa0/18):**
    
    ```
    Switch(config)# interface fa0/18
    ```
    
3. **ุฎูู ุงููููุฐ Access Port** (ูุนูู ููููู ุชุงุจุน ูู VLAN ูุงุญุฏุฉ ุจุณุ ูุด Trunk):
    
    ```
    Switch(config-if)# switchport mode access
    ```
    
4. **ุงุฑุจุท ุงููููุฐ ุจุงูู VLAN ุงููุทููุจุฉ (ูุซูุงู VLAN 20):**
    
    ```
    Switch(config-if)# switchport access vlan 20
    ```
    
5. **ุงุฑุฌุน ูููุถุน ุงูุชูููุฐู (Privileged EXEC):**
    
    ```
    Switch(config-if)# end
    ```
    

---

### โ ูุซุงู ูุงูู

ุนุงูุฒ ุฃุฎูู ุงููููุฐ **fa0/18** ููุชูู ูู VLAN 20:

```
 configure terminal
interface fa0/6
switchport mode access
switchport access vlan 30
 end
```

---

### ๐ ุงููุชูุฌุฉ

- ุฃู ุฌูุงุฒ (ููุจููุชุฑุ ุจุฑูุชุฑุ โฆ) ูุชูุตู ุจุงููููุฐ **fa0/18** ููุจูู ุนุถู ูู VLAN 20.
    
- ุงูุฌูุงุฒ ูุงุฒู ูุงุฎุฏ IP ูู ููุณ ุดุจูุฉ ุงูู VLAN ุฏู (ูุซูุงู 172.17.20.x).
    

---

ุชุญุจ ุฃุดุฑุญูู ููุงู ุฅุฒุงู ุชุชุญูู ุฅู ุงููููุฐ ุจูู ูุฑุจูุท ุจุงูู VLAN (ุจุงูุฃูุงูุฑ `show vlan brief` ุฃู `show running-config`)ุ

