
## ğŸ¯ Ø§Ù„Ø³ÙŠÙ†Ø§Ø±ÙŠÙˆ

- Ø¹Ù†Ø¯Ùƒ Ø±Ø§ÙˆØªØ± Ù…ØªÙˆØµÙ„ Ø¨Ø§Ù„Ù€ ISP.
    
- Ø§Ù„Ø±Ø§ÙˆØªØ± Ù…Ø­ØªØ§Ø¬ ÙŠØ§Ø®Ø¯ Ø¹Ù†ÙˆØ§Ù† IP Ø¹Ù„Ù‰ ÙˆØ§Ø¬Ù‡Ø© **G0/0/1** Ù…Ù† Ø³ÙŠØ±ÙØ± DHCP (Ø¹Ù†Ø¯ Ø§Ù„Ù€ ISP).
    
- Ø¨Ø¹Ø¯ ÙƒØ¯Ù‡ Ù‡Ù†ØªØ£ÙƒØ¯ Ø¥Ù† Ø§Ù„ÙˆØ§Ø¬Ù‡Ø© Ø§Ø´ØªØºÙ„Øª ÙˆØ®Ø¯Øª IP.
    

---

## ğŸ› ï¸ Ø®Ø·ÙˆØ§Øª Ø§Ù„ØªÙ†ÙÙŠØ°

### 1. Ù†Ø¯Ø®Ù„ Ø¹Ù„Ù‰ Ø§Ù„Ø±Ø§ÙˆØªØ±

```bash
Router> enable
Router#
```

---

### 2. Ù†Ø¯Ø®Ù„ Ø¹Ù„Ù‰ ÙˆØ¶Ø¹ Ø§Ù„Ø¥Ø¹Ø¯Ø§Ø¯Ø§Øª

```bash
Router# configure terminal
Router(config)#
```

---

### 3. Ù†Ø¶Ø¨Ø· Ø§Ù„ÙˆØ§Ø¬Ù‡Ø© ÙƒÙ€ DHCP Client

Ù†ÙØªØ±Ø¶ Ø¥Ù† Ø§Ù„ÙˆØ§Ø¬Ù‡Ø© Ø§Ù„Ù„ÙŠ Ø±Ø§ÙŠØ­Ø© Ù„Ù„Ù€ ISP Ù‡ÙŠ `G0/0/1`:

```bash
Router(config)# interface g0/0/1
Router(config-if)# ip address dhcp
Router(config-if)# no shutdown
```

âœ… Ù‡Ù†Ø§ Ø§Ù„Ø±Ø§ÙˆØªØ± Ø¨Ù‚Ù‰ ÙŠØ¨Ø¹Ø« Ø±Ø³Ø§Ø¦Ù„ DHCP (Discover â†’ Offer â†’ Request â†’ ACK) Ø¹Ø´Ø§Ù† ÙŠØ§Ø®Ø¯ IP.

---

### 4. Ø§Ù„ØªØ£ÙƒØ¯ Ù…Ù† Ø¥Ù† Ø§Ù„ÙˆØ§Ø¬Ù‡Ø© Ø®Ø¯Øª IP

```bash
Router# show ip interface brief
```

ğŸ“Œ Ù…Ø«Ø§Ù„ Ø¹Ù„Ù‰ Ø§Ù„Ù†ØªÙŠØ¬Ø©:

```
Interface              IP-Address      OK? Method Status                Protocol
GigabitEthernet0/0/0   unassigned      YES unset  administratively down down
GigabitEthernet0/0/1   209.165.201.12  YES DHCP   up                    up
```

- Ø¨Ø§ÙŠÙ† Ø¥Ù† `G0/0/1` Ø£Ø®Ø°Øª IP: `209.165.201.12` Ø¨Ø§Ù„Ø·Ø±ÙŠÙ‚Ø© DHCP.
    
- ÙƒÙ„Ù…Ø© **Method = DHCP** Ù…Ø¹Ù†Ø§Ù‡Ø§ Ø¥Ù† Ø§Ù„Ø¹Ù†ÙˆØ§Ù† Ø¬Ù‡ Ù…Ù† DHCP Server.
    

---

### 5. Ø§Ù„ØªØ£ÙƒØ¯ Ù…Ù† Ø¥Ø¹Ø¯Ø§Ø¯Ø§Øª DHCP Ø¹Ù„Ù‰ Ø§Ù„ÙˆØ§Ø¬Ù‡Ø©

```bash
Router# show running-config
```

ğŸ“Œ Ù‡ØªÙ„Ø§Ù‚ÙŠ:

```
interface GigabitEthernet0/0/1
 ip address dhcp
 no shutdown
```

---

### 6. (Ø§Ø®ØªÙŠØ§Ø±ÙŠ) ØªØªØ£ÙƒØ¯ Ù…Ù† Ù…Ø¹Ù„ÙˆÙ…Ø§Øª DHCP Ø§Ù„Ù…Ø³ØªÙ„Ù…Ø©

```bash
Router# show dhcp lease
```

ğŸ“Œ Ù…Ø«Ø§Ù„ Ø¹Ù„Ù‰ Ø§Ù„Ù†ØªÙŠØ¬Ø©:

```
Temp IP addr: 209.165.201.12 for peer on Interface: GigabitEthernet0/0/1
DHCP Lease server: 209.165.201.1, state: 3 Bound
Lease: 86400 seconds, Renewal: 43200 seconds, Rebind: 75600 seconds
```

- Ù‡Ù†Ø§ ÙˆØ§Ø¶Ø­ Ø§Ù„Ù€ IP Ø§Ù„Ù„ÙŠ Ø§Ø³ØªÙ„Ù…Ù‡ØŒ Ø§Ù„Ø³ÙŠØ±ÙØ± Ø§Ù„Ù„ÙŠ ÙˆØ²Ø¹Ù‡ØŒ ÙˆÙ…Ø¯Ø© Ø§Ù„ØªØ¬Ø¯ÙŠØ¯ (lease time).
    

---

## âœ… Ø§Ù„Ø®Ù„Ø§ØµØ©

- Ø¶Ø¨Ø·Ù†Ø§ Ø§Ù„ÙˆØ§Ø¬Ù‡Ø© ÙƒÙ€ DHCP Client Ø¨Ø§Ø³ØªØ®Ø¯Ø§Ù…:
    
    ```bash
    ip address dhcp
    no shutdown
    ```
    
- ØªØ£ÙƒØ¯Ù†Ø§ Ø¥Ù† Ø§Ù„ÙˆØ§Ø¬Ù‡Ø© Ø®Ø¯Øª IP Ù…Ù† DHCP Server.
    
- Ø´ÙÙ†Ø§ Ø¥Ø¹Ø¯Ø§Ø¯Ø§Øª Ø§Ù„Ù€ DHCP Lease Ø§Ù„Ù„ÙŠ Ø§ØªØ®Ø¯Øª Ù…Ù† Ø§Ù„Ù€ ISP.
    

---
