
### ุฎุทูุงุช ุชูุนูู ูุงุณุชุฎุฏุงู **Auto-MDIX** ูู ูุญููุงุช Cisco:

1. **ุงูุฏุฎูู ุนูู ูุถุน ุงูุฅุนุฏุงุฏุงุช ููุฅูุชุฑููุณ**
    
    - ุญุฏุฏ ุงูุจูุฑุช ุงููู ูุชุดุชุบู ุนููู:
        
    
    ```bash
    S1(config)# interface fastEthernet 0/1
    ```
    
2. **ุชุฃูุฏ ุฅู ุงูุณุฑุนุฉ (speed) ู ุงูู Duplex ุนูู ูุถุน Auto**
    
    - ุฏู ุดุฑุท ุฃุณุงุณู ุนูุดุงู Auto-MDIX ูุดุชุบู:
        
    
    ```bash
    S1(config-if)# speed auto
    S1(config-if)# duplex auto
    ```
    
3. **ุชูุนูู Auto-MDIX**
    
    - ุงุณุชุฎุฏู ุงูุฃูุฑ:
        
    
    ```bash
    S1(config-if)# mdix auto
    ```
    
4. **ุงูุฎุฑูุฌ ูู ุงูุฅุนุฏุงุฏุงุช**
    
    ```bash
    S1(config-if)# exit
    ```
    
5. **ุงูุชุญูู ูู ุชูุนูู Auto-MDIX**
    
    - ุชูุฏุฑ ุชุชุฃูุฏ ุจุงุณุชุฎุฏุงู ุงูุฃูุฑ:
        
    
    ```bash
    S1# show controllers ethernet-controller fastEthernet 0/1 phy | include Auto-MDIX
    ```
    

---

๐ **ููุญูุธุฉ ูููุฉ**:

- ูู ุณููุชุดุงุช Cisco ุงูุญุฏูุซุฉ (ุฒู Catalyst 2960 ู 3560) ุงูู Auto-MDIX ุจูููู ุดุบุงู **ุงูุชุฑุงุถููุง**.
    
- ูู ุดุบุงู ุนูู ุฃุฌูุฒุฉ ุฃุญุฏุซุ ูููู ูุงุชุญุชุงุฌุด ุชูุนููู ูุฏูู.
    

